package Home_work4;

import java.util.Scanner;

public class Calculator {
    public static void main(String[] args) {
        /*
            Задание 2
            Используя IntelliJ IDEA, создайте класс Calculator.
            Напишите программу – консольный калькулятор.
            Создайте две переменные с именами operand1 и operand2. Задайте переменным некоторые
            произвольные значения. Предложите пользователю ввести знак арифметической операции. Примите
            значение, введенное пользователем и поместите его в строковую переменную sign.
            Для организации выбора алгоритма вычислительного процесса, используйте переключатель switch.
            Выведите на экран результат выполнения арифметической операции.
            В случае использования операции деления, организуйте проверку попытки деления на ноль. И если
            таковая имеется, то отмените выполнение арифметической операции и уведомите об ошибке
            пользователя.
         */

        // Об'явлення змінних
        int operand1;
        int operand2;
        String sign;
        Scanner userInput;

        // Ініціалізація першого операнду
        userInput = new Scanner(System.in);             // Ініціалізація сканера
        System.out.println("ведіть перший операнд :");  // Повідомлення про готовність программи прийняти операнд
        operand1 = userInput.nextInt();                 // Присвоєння нового операнду

        // Ініціалізація дургого операнду
        userInput = new Scanner(System.in);             // Реініціалізація сканера (видалення зайвого сміття)
        System.out.println("ведіть другий операнд :");  // Повідомлення про готовність программи прийняти операнд
        operand2 = userInput.nextInt();                 // Присвоєння нового операнду

        // Ініціалізація знаку операції
        userInput = new Scanner(System.in);             // Реініціалізація сканера (видалення зайвого сміття)
        System.out.println("ведіть операцію :");        // Повідомлення про готовність программи прийняти знак
        sign = userInput.next();                        // Присвоєння знаку

        // Перевірка по знаку
        switch (sign)
        {
            case "-":                                       // Віднімання
                System.out.println(operand1 - operand2);
                break;
            case "+":                                       // Додавання
                System.out.println(operand1 + operand2);
                break;
            case "*":                                       // Множення
                System.out.println(operand1 * operand2);
                break;
            case "%":                                       // Ділення з залишком
                System.out.println(operand1 % operand2);
                break;
            case "/":                                       // Ділення
                if (operand2 != 0)                          // Перевірка дільника на нуль
                {
                    System.out.println(operand1 / operand2);    // Якщо не нуль, то виконуємо операцію
                }
                else
                {
                    System.out.println("Ділення на нуль неможливе!");   // Якщо нуль, то видаємо помилку
                }
                break;
            default:
                System.out.println("Невалідно введена операція!");      // Якщо прийшов невалідний знак
        }
        /*
            Приклад:
            ведіть перший операнд :
            658
            ведіть другий операнд :
            967
            ведіть операцію :
            -
            -309
         */

    }
}
