package Home_work2;

public class Task2 {
    public static void main(String[] args) {


        /*
        Задание 2
        Используя IntelliJ IDEA, создайте проект.
        Дано значение числа pi, которое равно 3,141592653 и значение числа Эйлера е, которое равно
        2,7182818284590452. Создайте две переменные, присвойте им значения числа pi и числа е и выведите
        их на экран без потери точности.
        */

        double pi = 3.141592653d;
        double e = 2.7182818284590452d;

        System.out.println(pi);
        System.out.println(e);

        /*
        Вмвід > 3.141592653
                2.718281828459045
        Примітка: Все таки в числі ейлера була втрачена остання двійка. Не знайшов як це можна висправити.
        */
    }
}
