package Practice_lesson6;

public class Task1 {
    /*
        Написать цикл, который выводит на экран с 0 до 10 числа;
        Написать цикл который выводит на экран числа с 10 до 0;
        Написать цикл, который выводит ТОЛЬКО четные числа с 0 до 10;
        Написать цикл который выводит ТОЛЬКО НЕ четные числа с 10 до 0;
        Это должно быть именно 4 разных цикла.
     */
    public static void main(String[] args) {

        // Цикл від 0 до 10
        System.out.print("Числа від 0 до 10:");
        for (int i = 0; i <= 10; i++){
            System.out.print(" " + i);
        }
        System.out.print('\n');

        // Цикл від 10 до 0
        System.out.print("Числа від 10 до 0:");
        for (int i = 10; i >= 0; i--){
            System.out.print(" " + i);
        }
        System.out.print('\n');

        // Цикл виводу парних чисел в зростаючому порядку від 0 до 10
        System.out.print("Парні числа від 0 до 10:");
        for  (int i = 0; i <= 10; i++){
            if (i % 2 == 0) {
                System.out.print(" " + i);
            }
        }
        System.out.print('\n');

        // Цикл виводу непарних чисел в спадаючому порядку від 10 до 0
        System.out.print("Непарні числа від 0 до 10:");
        for (int i = 10; i >= 0; i--){
            if (i % 2 != 0) {
                System.out.print(" " + i);
            }
        }
        System.out.print('\n');
        /*
            Вивід:
            Числа від 0 до 10: 0 1 2 3 4 5 6 7 8 9 10
            Числа від 10 до 0: 10 9 8 7 6 5 4 3 2 1 0
            Парні числа від 0 до 10: 0 2 4 6 8 10
            Непарні числа від 0 до 10: 9 7 5 3 1
        */
    }
}
