package Home_work_OOP.Task4.Computers;

import Home_work_OOP.Task4.Computer.Computer;

public class Computers {
    /*
        Задание 4
        Используя IDEA, создайте проект с пакетом. Создать класс Computer, создать массив объектов
        Computers размером 5. Далее руками создать 5 экземпляров этого класса и записать в компьютер
        (используя loop)
     */

    public static void main(String[] args) {
        Computer [] computers = new Computer[5];            // Ініціалізація масиву

        // Ініціалізація кожного елементу масива
        for (int i = 0; i < computers.length; i++) {
            computers[i] = new Computer("I5-7200U", "RTX3070",
                    64, 5);
        }

        // Вивід ініціалізованих об'єктів масиву
        for (int i = 0; i < computers.length; i++) {
            System.out.println("Комп'ютер №: " + (i + 1) );
            System.out.println("Назва процессора: " + computers[i].getCpuName());
            System.out.println("Назва відеокарти: " +computers[i].getGpuName());
            System.out.println("Кількість пам'яті в тб: " +computers[i].getSizeOfHHDInTB());
            System.out.println("Кількість оперативної пам'яті в гб: " +computers[i].getSizeOfRAMInGB() + '\n');
        }
        /*
            Вивід:
            Комп'ютер №: 1
            Назва процессора: I5-7200U
            Назва відеокарти: RTX3070
            Кількість пам'яті в тб: 5
            Кількість оперативної пам'яті в гб: 64

            Комп'ютер №: 2
            Назва процессора: I5-7200U
            Назва відеокарти: RTX3070
            Кількість пам'яті в тб: 5
            Кількість оперативної пам'яті в гб: 64

            Комп'ютер №: 3
            Назва процессора: I5-7200U
            Назва відеокарти: RTX3070
            Кількість пам'яті в тб: 5
            Кількість оперативної пам'яті в гб: 64

            Комп'ютер №: 4
            Назва процессора: I5-7200U
            Назва відеокарти: RTX3070
            Кількість пам'яті в тб: 5
            Кількість оперативної пам'яті в гб: 64

            Комп'ютер №: 5
            Назва процессора: I5-7200U
            Назва відеокарти: RTX3070
            Кількість пам'яті в тб: 5
            Кількість оперативної пам'яті в гб: 64
         */
    }
}
