package Home_Work5;

public class DeMorganComparison {
    /*
        Задание 2
        Используя IntelliJ IDEA, создайте класс DeMorganComparison.
        Используя теорему Де Моргана, преобразуйте исходное выражение A | B, в эквивалентное выражение.
     */
    public static void main(String[] args) {
        byte a = 3;
        byte b = 14;

        System.out.printf("Результат через звичайний вираз :%d\n", (a | b));

        // Відповідно до теореми Де Моргана кон'юкцію можна виразити через диз'юнкції з трьома запереченнями
        System.out.printf("Результат через теорему Де Моргана :%d\n", (~((~a) & (~b))));

        /*
            Вивід:
            Результат через звичайний вираз :15
            Результат через теорему Де Моргана :15
         */
    }
}

