package Home_Work5;

import java.util.Scanner;

public class PowerOfTwo {
    /*
        Задание 1
        Известно, что у чисел, которые являются степенью двойки, только один бит имеет значение 1.
        Используя IntelliJ IDEA, создайте класс PowerOfTwo.
        Напишите программу, которая будет выполнять проверку – является ли указанное число степенью
        двойки или нет.
     */
    public static void main(String[] args) {
        int         userInteger;            // Число зчитане від користувача
        Scanner     userInput;              // Зміння для зчитування інформації з консолі
        int         localPowOfTwo = 2;      // Змінна для порівняння, яка при кроці циклу зміщує біт вліво
        int         powValue = 1;           // Кількість ітерацій до знаходження степіні

        // Зчитування числа від користувача
        userInput = new Scanner(System.in);                 // Ініціалізація сканеру
        System.out.println("Введіть довільне число :");     // Повідомлення з проханням ввести число
        userInteger = userInput.nextInt();                  // Запис числа

        // Поки число з яким порівнюється число користувача менша ніж максимальна степінь двійки яка може зберігатися
        // в діапазоні int
        while (localPowOfTwo < 1073741824 )
        {
            // Якщо локальна степінь двійки дорівнює значенню користувача
            if (userInteger == localPowOfTwo)
            {
                //Видодимо відовідне повідомлення і завершуємо программу
                System.out.printf("Число %d = 2 в %d степіні", userInteger, powValue);
                return ;
            }
            // Підносимо до наступної степені
            localPowOfTwo = localPowOfTwo << 1;

            // Інкрементуємо значення степені для додаткової інформації користувачу
            powValue++;
        }
        // Якщо за ввесь цикл не вдалося знайти число, то тоді число не являється степінню двійки
        System.out.printf("Число %d не являється степінню двійки", userInteger);

        /*
            Приклад виводу:
            Введіть довільне число :
            65536
            Число 65536 = 2 в 16 степіні
         */
    }
}
